let questions = [
    {
        "question":"你做事是一個值得信賴的人嗎?",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你個性溫和嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你有活力嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你善解人意嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你獨立嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你受人愛戴嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"做事認真且正直嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你精確嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你適應能力強嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你組織能力好嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你是否積極主動？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你害羞嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你強勢嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你鎮定嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你勇於學習嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你反應快嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你外向嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你注意細節嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你愛說話嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你的協調能力好嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你勤勞嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你慷慨嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你小心翼翼嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你令人愉快嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你傳統嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你親切嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    },
    {
        "question":"你工作足夠有效率嗎？",
        "answers":[
            ["非常同意",2],
            ["比較同意",1],
            ["差不多 ",0],
            ["比較不同意",-1],
            ["非常不同意",-2]
        ]
    }
    
];

let finalAnswers={
        "A":["老虎型 (支配型Dominance) ","“老虎”一般企圖心強烈，喜歡冒險，個性積極，競爭力強，凡事喜歡掌控全局發號施令，不喜歡維持現狀，但行動力強，目標一經確立便會全力以赴。它的缺點是在決策上較易流於專斷，不易妥協，故較容易與人發生爭執摩擦。如果下屬中有“老虎”要給予他更多的責任，他會覺得自己有價值，佈置工作時注意結果導向，如果上司是老虎則要在他面前展示自信果斷的一面，同時避免在公衆場合與他唱反調。中外名人中毛澤東、朱熔基以及前英國首相柴契爾夫人爲較典型的老虎型，德國爲老虎型人數最多的國家。"],
        "B":["孔雀型(表達型Extroversion)","“孔雀”熱情洋溢，好交朋友，口才流暢，重視形象，擅于人際關係的建立，富同情心，最適合人際導向的工作。缺點是容易過於樂觀，往往無法估計細節，在執行力度上需要高專業的技術精英來配合。對孔雀要以鼓勵爲主給他表現機會保持他的工作激情，但也要注意他的情緒化和防止細節失誤。孫中山、克林頓、雷根、戈巴契夫都是這一類型的人，美國是孔雀型人最多的國家。 "],
        "C":["無尾熊型 (耐心型Pace/Patience) ","“無尾熊”屬於行事穩健，不會誇張強調平實的人，性情平和對人不喜歡製造麻煩，不興風作浪，溫和善良，在別人眼中常讓人誤以爲是懶散不積極，但只要決心投入，絕對是“路遙知馬力”的最佳典型。對考拉要多給予關注和溫柔想方設法挖掘他們內在的潛力。印度的甘地、蔣經國、宋慶齡都是此類型的人，一般而言，宗教信仰者都是“無尾熊”，而中國正是無尾熊型最多的搖籃。"],
        "D":["貓頭鷹型 (精確型Conformity) ","“貓頭鷹”傳統而保守，分析力強，精確度高是最佳的品質保證者，喜歡把細節條例化，個性拘謹含蓄，謹守分寸忠於職責，但會讓人覺得“吹毛求疵”。“貓頭鷹”清晰分析道理說服別人很有一套，處事客觀合理，只是有時會鑽在牛角尖裏拔不出來。古代斷案如神的包拯（包青天）正是此種類型的典範。日本是這個類型人數較多的國家。"],
        "E":["變色龍型 (整合型1/2 Sigma)","“變色龍”中庸而不極端，凡事不執著，韌性極強，擅于溝通是天生的談判家，他們能充分融入各種新環境新文化且適應性良好，在他人眼中會覺得他們“沒有個性”，故“沒有原則就是最高原則”，他們懂得凡事看情況看場合。前總理周恩來、美國前國務卿基辛格、諸葛亮都是這種類型。香港和臺灣是變色龍較多的地區。"]
    };